In [ ]:
import pandas as pd

In [10]:
df = pd.read_csv('Alumnos.csv')

In [11]:
df

   Nombre   Edad Genero       Carrera Semestre
0   Victor    28      M     Auditoria  Primero
1    Laura    23      F   Informatica  Primero
2     Raul    26      M       Derecho   Quinto
3    Lucia    27      F   Informatica  Septimo
4  Rodrigo    22      M       Derecho  Tercero
5     Luis    25      M  Arquitectura  Septimo
6      Ana    23      F   Informatica  Primero
7  Joaquin    24      M      Economia   Noveno

In [1]:
convertir = pd.read_excel('Alumnos.xlsx')

NameError: name 'pd' is not defined

In [9]:
convertir.to_csv('Alumnos.csv', index=None, header=True)